Introduccion  a  Pandas
* Pandas es una biblioteca open source contruida sobre Numpy
* Nos  permite analizar, limpiar y preparar datos de una manera facil.
* Es una version mejorada y mas que excel.
* Tambien tienen sus propias caracteristicas de visualizacion.
*Puede trabajar con datos de una aplica de variedad.
*Podemos instalar pandas via o pip

       * conda  install pandas
       * pip install pandas
       * pip3 install pandas

* Serie.
* Data Frames.
* Agrupaciones-GroupBy
* Concatenacion, Uniones, Merge.
* Operaciones.
* Datos de Entrada y salida

In [1]:
import pandas

Series

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
etiquetas = ['A','B','C']   # lista

In [5]:
my_data = [10,20,30]      # lista

In [6]:
arr =np.array(my_data)

In [7]:
arr

array([10, 20, 30])

In [8]:
etiquetas

['A', 'B', 'C']

In [9]:
d= {'a':10,'b':20,'c':30}    #diccionario

In [10]:
d

{'a': 10, 'b': 20, 'c': 30}

In [11]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(data=my_data, index=etiquetas)

A    10
B    20
C    30
dtype: int64

In [13]:
pd.Series(etiquetas, my_data)

10    A
20    B
30    C
dtype: object

In [15]:
pd.Series(my_data, etiquetas)

A    10
B    20
C    30
dtype: int64

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(data=[sum,len,str])

0    <built-in function sum>
1    <built-in function len>
2               <type 'str'>
dtype: object

In [37]:
ser1 = pd.Series([1,2,3,4],['USA','MEXICO','ALEMANIA','JAPON'])

In [41]:
ser2 = pd.Series([1,2,3,4],['CHINA','COREA DEL SUR','ITALIA','RUSIA'])

In [42]:
ser1

USA         1
MEXICO      2
ALEMANIA    3
JAPON       4
dtype: int64

In [43]:
ser2

CHINA            1
COREA DEL SUR    2
ITALIA           3
RUSIA            4
dtype: int64

In [34]:
ser2["ITALIA"]

3

In [32]:
ser3= pd.Series(data=etiquetas)

In [35]:
ser2["ITALIA"]

3

In [44]:
ser3

0    A
1    B
2    C
dtype: object

In [46]:
ser3[1]

'B'

Dataframes la herramienta principal de Pandas

In [47]:
import numpy as np

In [48]:
import pandas as pd

In [49]:
from numpy.random import randn

In [50]:
np.random.seed(101)

In [52]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [53]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [59]:
df['Z']

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: Z, dtype: float64

In [60]:
df['W']['A']

0.30266544858518252

In [62]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [63]:
df['new'] = df['W']+df['X']

In [64]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [65]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [66]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [67]:
df.drop('new',axis=1,inplace=True)

In [68]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [69]:
df.drop('A')

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [70]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [71]:
df.shape

(5, 4)

In [72]:
type(df.shape)

tuple

In [76]:
df.loc['E']

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: E, dtype: float64

In [77]:
df.loc['B']

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [78]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [79]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [80]:
df.loc['B','Y']

0.16690463609281317

In [81]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [82]:
df.loc[['A','B'],['W','Y']].mean()

W    0.083912
Y   -0.769591
dtype: float64

In [83]:
df.loc[['A','B'],['W','Y']].count()

W    2
Y    2
dtype: int64

In [84]:
df.loc[['A','B'],['W','Y']].pow(10)

              W             Y
A  6.451021e-06  2.089340e+02
B  1.987058e-09  1.677583e-08

In [86]:
df.loc[['A','B'],['W','Y']].pow(0.5)

         W        Y
A  0.55015      NaN
B      NaN  0.40854

In [93]:
booldf= df>0

In [94]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

Dataframes  2
Seleccion condicional usando notacion de corchetes.

In [91]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [96]:
df[booldf]    # corchetes

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [98]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [99]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [100]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [101]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [102]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [103]:
#mayores de 1  en  'X'

In [104]:
df[df['X']>1]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
E -0.116773  1.901755  0.238127  1.996652

In [111]:
#menores de -1   en   'X'

In [112]:
df[df['X']<-1]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [113]:
#menores de -1   en   'Z'

In [114]:
df[df['Z']<-1]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [117]:
df[df['W']>0][['Y','X']].sum()

Y   -1.067299
X    1.766683
dtype: float64

In [118]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [119]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [121]:
df[(df['W']>0)  &  (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [122]:
df[(df['W']>0)  |  (df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646